Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F769I-EVAL.c
PG11, // |MII_TX_EN [DP83848CVV_TX_EN]               |    |    |    |    |+SCK |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG12, // |SPDIF_RX1 [DLR11H0_1]                      |    |    |    |    |     |     |     |     |     |+MISO|      |      |      |      |     |*LPTIM1_IN1                               |          |          |           
PG13, // |MII_TXD0 [DP83848CVV_TXD0]                 |    |    |    |    |     |     |     |     |     |+SCK |      |      |      |      |     |                                          |          |          |+TRACED0   
PG14, // |MII_TXD1 [DP83848CVV_TXD1]                 |    |    |    |    |     |     |     |     |     |*MOSI|      |      |      |*TX   |     |                                          |          |          |+TRACED1   
PG15, // |SDNCAS [IS42S32800G-6BLI_CAS]              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH0 , // |OSC_IN                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC_IN   |           
PH1 , // |OSC_OUT                                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC_OUT  |           
PH2 , // |SDCKE0 [IS42S32800G_CKE]                   |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+LPTIM1_IN2                               |          |          |           
PH3 , // |SDNE0 [IS42S32800G_CS]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH4 , // |ULPI_NXT [USB3300-EZK_NXT]                 |    |+SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH5 , // |SDNWE [IS42S32800G_WE]                     |    |+SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH6 , // |MII_RXD2 [DP83848CVV_RXD_2/PHYAD3]         |    |    |    |    |     |     |     |     |+SCK |     |      |      |      |      |     |*TIM12_CH1                                |          |          |           
PH7 , // |MII_RXD3 [DP83848CVV_RXD_3/PHYAD4]         |    |    |+SCL|    |     |     |     |     |+MISO|     |      |      |      |      |     |                                          |          |          |           
PH8 , // |D16 [IS42S32800G_DQ16]                     |    |    |+SDA|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PH9 , // |D17 [IS42S32800G_DQ17]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM12_CH2                                |          |          |           
PH10, // |D18 [IS42S32800G_DQ18]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM5_CH1                                 |          |          |           
PH11, // |D19 [IS42S32800G_DQ19]                     |    |    |    |+SCL|     |     |     |     |     |     |      |      |      |      |     |+TIM5_CH2                                 |          |          |           
PH12, // |D20 [IS42S32800G_DQ20]                     |    |    |    |+SDA|     |     |     |     |     |     |      |      |      |      |     |*TIM5_CH3                                 |          |          |           
PH13, // |D21 [IS42S32800G_DQ21]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH1N                                |          |          |           
PH14, // |D22 [IS42S32800G_DQ22]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH2N                                |          |          |           
PH15, // |D23 [IS42S32800G_DQ23]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH3N                                |          |          |           
PI0 , // |D24 [IS42S32800G_DQ24]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM5_CH4                                 |          |          |           
PI1 , // |D25 [IS42S32800G_DQ25]                     |    |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI2 , // |D26 [IS42S32800G_DQ26]                     |    |    |    |    |     |*MISO|     |     |     |     |      |      |      |      |     |*TIM8_CH4                                 |          |          |           
PI3 , // |D27 [IS42S32800G_DQ27]                     |    |    |    |    |     |*MOSI|     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI4 , // |FMC_NBL2 [IS42S32800G_DQM2]                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI5 , // |FMC_NBL3 [IS42S32800G_DQM3]                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH1                                 |          |          |           
PI6 , // |D28 [IS42S32800G_DQ28]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH2                                 |          |          |           
PI7 , // |D29 [IS42S32800G_DQ29]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH3                                 |          |          |           
PI8 , // |EXPANDER_INT                               |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI9 , // |D30 [IS42S32800G_DQ30]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI10, // |D31 [IS42S32800G_DQ31]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI11, // |ULPI_DIR [USB3300_DIR]                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI12, // |LCD_HSYNC                                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI13, // |LCD_VSYNC                                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI14, // |LCD_CLK                                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PI15, // |LED0 (green)                               |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ0 , // |LED1 (Orange)                              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ1 , // |LED2 (red)                                 |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ2 , // |DSI_TE                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ3 , // |LED3 (Blue)                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ4 , // |LCD_R5                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ5 , // |LCD_R6                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ12, // |MII_MDIO_GPIO                              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ13, // |MII_MDC_GPIO                               |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ14, // |LCD_B2                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PJ15, // |LCD_B3                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK3 , // |LCD_B4                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK4 , // |LCD_B5                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK5 , // |LCD_B6                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK6 , // |LCD_B7                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PK7 , // |LCD_DE                                     |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD0 , GPIO_PIN_0 , GPIOD, GPIO_PIN_IO, false},
  { PD1 , GPIO_PIN_1 , GPIOD, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PD3 , GPIO_PIN_3 , GPIOD, GPIO_PIN_IO, false},
  { PD4 , GPIO_PIN_4 , GPIOD, GPIO_PIN_IO, false},
  { PD5 , GPIO_PIN_5 , GPIOD, GPIO_PIN_IO, false},
  { PD6 , GPIO_PIN_6 , GPIOD, GPIO_PIN_IO, false},
  { PD7 , GPIO_PIN_7 , GPIOD, GPIO_PIN_IO, false},
  { PD8 , GPIO_PIN_8 , GPIOD, GPIO_PIN_IO, false},
  { PD9 , GPIO_PIN_9 , GPIOD, GPIO_PIN_IO, false},
  { PD10, GPIO_PIN_10, GPIOD, GPIO_PIN_IO, false},
  { PD11, GPIO_PIN_11, GPIOD, GPIO_PIN_IO, false},
  { PD12, GPIO_PIN_12, GPIOD, GPIO_PIN_IO, false},
  { PD13, GPIO_PIN_13, GPIOD, GPIO_PIN_IO, false},
  { PD14, GPIO_PIN_14, GPIOD, GPIO_PIN_IO, false},
  { PD15, GPIO_PIN_15, GPIOD, GPIO_PIN_IO, false},
  { PE0 , GPIO_PIN_0 , GPIOE, GPIO_PIN_IO, false},
  { PE1 , GPIO_PIN_1 , GPIOE, GPIO_PIN_IO, false},
  { PE2 , GPIO_PIN_2 , GPIOE, GPIO_PIN_IO, false},
  { PE3 , GPIO_PIN_3 , GPIOE, GPIO_PIN_IO, false},
  { PE4 , GPIO_PIN_4 , GPIOE, GPIO_PIN_IO, false},
  { PE5 , GPIO_PIN_5 , GPIOE, GPIO_PIN_IO, false},
  { PE6 , GPIO_PIN_6 , GPIOE, GPIO_PIN_IO, false},
  { PE7 , GPIO_PIN_7 , GPIOE, GPIO_PIN_IO, false},
  { PE8 , GPIO_PIN_8 , GPIOE, GPIO_PIN_IO, false},
  { PE9 , GPIO_PIN_9 , GPIOE, GPIO_PIN_IO, false},
  { PE10, GPIO_PIN_10, GPIOE, GPIO_PIN_IO, false},
  { PE11, GPIO_PIN_11, GPIOE, GPIO_PIN_IO, false},
  { PE12, GPIO_PIN_12, GPIOE, GPIO_PIN_IO, false},
  { PE13, GPIO_PIN_13, GPIOE, GPIO_PIN_IO, false},
  { PE14, GPIO_PIN_14, GPIOE, GPIO_PIN_IO, false},
  { PE15, GPIO_PIN_15, GPIOE, GPIO_PIN_IO, false},
  { PF0 , GPIO_PIN_0 , GPIOF, GPIO_PIN_IO, false},
  { PF1 , GPIO_PIN_1 , GPIOF, GPIO_PIN_IO, false},
  { PF2 , GPIO_PIN_2 , GPIOF, GPIO_PIN_IO, false},
  { PF3 , GPIO_PIN_3 , GPIOF, GPIO_PIN_IO, false},
  { PF4 , GPIO_PIN_4 , GPIOF, GPIO_PIN_IO, false},
  { PF5 , GPIO_PIN_5 , GPIOF, GPIO_PIN_IO, false},
  { PF6 , GPIO_PIN_6 , GPIOF, GPIO_PIN_IO, false},
  { PF7 , GPIO_PIN_7 , GPIOF, GPIO_PIN_IO, false},
  { PF8 , GPIO_PIN_8 , GPIOF, GPIO_PIN_IO, false},
  { PF9 , GPIO_PIN_9 , GPIOF, GPIO_PIN_IO, false},
  { PF10, GPIO_PIN_10, GPIOF, GPIO_PIN_IO, false},
  { PF11, GPIO_PIN_11, GPIOF, GPIO_PIN_IO, false},
  { PF12, GPIO_PIN_12, GPIOF, GPIO_PIN_IO, false},
  { PF13, GPIO_PIN_13, GPIOF, GPIO_PIN_IO, false},
  { PF14, GPIO_PIN_14, GPIOF, GPIO_PIN_IO, false},
  { PF15, GPIO_PIN_15, GPIOF, GPIO_PIN_IO, false},
  { PG0 , GPIO_PIN_0 , GPIOG, GPIO_PIN_IO, false},
  { PG1 , GPIO_PIN_1 , GPIOG, GPIO_PIN_IO, false},
  { PG2 , GPIO_PIN_2 , GPIOG, GPIO_PIN_IO, false},
  { PG3 , GPIO_PIN_3 , GPIOG, GPIO_PIN_IO, false},
  { PG4 , GPIO_PIN_4 , GPIOG, GPIO_PIN_IO, false},
  { PG5 , GPIO_PIN_5 , GPIOG, GPIO_PIN_IO, false},
  { PG6 , GPIO_PIN_6 , GPIOG, GPIO_PIN_IO, false},
  { PG7 , GPIO_PIN_7 , GPIOG, GPIO_PIN_IO, false},
  { PG8 , GPIO_PIN_8 , GPIOG, GPIO_PIN_IO, false},
  { PG9 , GPIO_PIN_9 , GPIOG, GPIO_PIN_IO, false},
  { PG10, GPIO_PIN_10, GPIOG, GPIO_PIN_IO, false},
  { PG11, GPIO_PIN_11, GPIOG, GPIO_PIN_IO, false},
  { PG12, GPIO_PIN_12, GPIOG, GPIO_PIN_IO, false},
  { PG13, GPIO_PIN_13, GPIOG, GPIO_PIN_IO, false},
  { PG14, GPIO_PIN_14, GPIOG, GPIO_PIN_IO, false},
  { PG15, GPIO_PIN_15, GPIOG, GPIO_PIN_IO, false},
  { PH0 , GPIO_PIN_0 , GPIOH, GPIO_PIN_IO, false},
  { PH1 , GPIO_PIN_1 , GPIOH, GPIO_PIN_IO, false},
  { PH2 , GPIO_PIN_2 , GPIOH, GPIO_PIN_IO, false},
  { PH3 , GPIO_PIN_3 , GPIOH, GPIO_PIN_IO, false},
  { PH4 , GPIO_PIN_4 , GPIOH, GPIO_PIN_IO, false},
  { PH5 , GPIO_PIN_5 , GPIOH, GPIO_PIN_IO, false},
  { PH6 , GPIO_PIN_6 , GPIOH, GPIO_PIN_IO, false},
  { PH7 , GPIO_PIN_7 , GPIOH, GPIO_PIN_IO, false},
  { PH8 , GPIO_PIN_8 , GPIOH, GPIO_PIN_IO, false},
  { PH9 , GPIO_PIN_9 , GPIOH, GPIO_PIN_IO, false},
  { PH10, GPIO_PIN_10, GPIOH, GPIO_PIN_IO, false},
  { PH11, GPIO_PIN_11, GPIOH, GPIO_PIN_IO, false},
  { PH12, GPIO_PIN_12, GPIOH, GPIO_PIN_IO, false},
  { PH13, GPIO_PIN_13, GPIOH, GPIO_PIN_IO, false},
  { PH14, GPIO_PIN_14, GPIOH, GPIO_PIN_IO, false},
  { PH15, GPIO_PIN_15, GPIOH, GPIO_PIN_IO, false},
  { PI0 , GPIO_PIN_0 , GPIOI, GPIO_PIN_IO, false},
  { PI1 , GPIO_PIN_1 , GPIOI, GPIO_PIN_IO, false},
  { PI2 , GPIO_PIN_2 , GPIOI, GPIO_PIN_IO, false},
  { PI3 , GPIO_PIN_3 , GPIOI, GPIO_PIN_IO, false},
  { PI4 , GPIO_PIN_4 , GPIOI, GPIO_PIN_IO, false},
  { PI5 , GPIO_PIN_5 , GPIOI, GPIO_PIN_IO, false},
  { PI6 , GPIO_PIN_6 , GPIOI, GPIO_PIN_IO, false},
  { PI7 , GPIO_PIN_7 , GPIOI, GPIO_PIN_IO, false},
  { PI8 , GPIO_PIN_8 , GPIOI, GPIO_PIN_IO, false},
  { PI9 , GPIO_PIN_9 , GPIOI, GPIO_PIN_IO, false},
  { PI10, GPIO_PIN_10, GPIOI, GPIO_PIN_IO, false},
  { PI11, GPIO_PIN_11, GPIOI, GPIO_PIN_IO, false},
  { PI12, GPIO_PIN_12, GPIOI, GPIO_PIN_IO, false},
  { PI13, GPIO_PIN_13, GPIOI, GPIO_PIN_IO, false},
  { PI14, GPIO_PIN_14, GPIOI, GPIO_PIN_IO, false},
  { PI15, GPIO_PIN_15, GPIOI, GPIO_PIN_IO, false},
  { PJ0 , GPIO_PIN_0 , GPIOJ, GPIO_PIN_IO, false},
  { PJ1 , GPIO_PIN_1 , GPIOJ, GPIO_PIN_IO, false},
  { PJ2 , GPIO_PIN_2 , GPIOJ, GPIO_PIN_IO, false},
  { PJ3 , GPIO_PIN_3 , GPIOJ, GPIO_PIN_IO, false},
  { PJ4 , GPIO_PIN_4 , GPIOJ, GPIO_PIN_IO, false},
  { PJ5 , GPIO_PIN_5 , GPIOJ, GPIO_PIN_IO, false},
  { PJ12, GPIO_PIN_12, GPIOJ, GPIO_PIN_IO, false},
  { PJ13, GPIO_PIN_13, GPIOJ, GPIO_PIN_IO, false},
  { PJ14, GPIO_PIN_14, GPIOJ, GPIO_PIN_IO, false},
  { PJ15, GPIO_PIN_15, GPIOJ, GPIO_PIN_IO, false},
  { PK3 , GPIO_PIN_3 , GPIOK, GPIO_PIN_IO, false},
  { PK4 , GPIO_PIN_4 , GPIOK, GPIO_PIN_IO, false},
  { PK5 , GPIO_PIN_5 , GPIOK, GPIO_PIN_IO, false},
  { PK6 , GPIO_PIN_6 , GPIOK, GPIO_PIN_IO, false},
  { PK7 , GPIO_PIN_7 , GPIOK, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF5_SPI1,
    .mosi_port = GPIOB, 
    .mosi_pin =  GPIO_PIN_5, 
    .miso_alternate = GPIO_AF5_SPI1,
    .miso_port = GPIOB, 
    .miso_pin = GPIO_PIN_4, 
    .sck_alternate = GPIO_AF5_SPI1,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_3, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF5_SPI2,
    .mosi_port = GPIOI, 
    .mosi_pin =  GPIO_PIN_3, 
    .miso_alternate = GPIO_AF5_SPI2,
    .miso_port = GPIOI, 
    .miso_pin = GPIO_PIN_2, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_12, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI3, 
    .mosi_alternate = GPIO_AF6_SPI3,
    .mosi_port = GPIOB, 
    .mosi_pin =  GPIO_PIN_5, 
    .miso_alternate = GPIO_AF6_SPI3,
    .miso_port = GPIOB, 
    .miso_pin = GPIO_PIN_4, 
    .sck_alternate = GPIO_AF6_SPI3,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_3, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI4, 
    .mosi_alternate = GPIO_AF5_SPI4,
    .mosi_port = GPIOE, 
    .mosi_pin =  GPIO_PIN_6, 
    .miso_alternate = GPIO_AF5_SPI4,
    .miso_port = GPIOE, 
    .miso_pin = GPIO_PIN_5, 
    .sck_alternate = GPIO_AF5_SPI4,
    .sck_port = GPIOE, 
    .sck_pin = GPIO_PIN_2, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI5, 
    .mosi_alternate = GPIO_AF5_SPI5,
    .mosi_port = GPIOF, 
    .mosi_pin =  GPIO_PIN_9, 
    .miso_alternate = GPIO_AF5_SPI5,
    .miso_port = GPIOF, 
    .miso_pin = GPIO_PIN_8, 
    .sck_alternate = GPIO_AF5_SPI5,
    .sck_port = GPIOF, 
    .sck_pin = GPIO_PIN_7, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI6, 
    .mosi_alternate = GPIO_AF5_SPI6,
    .mosi_port = GPIOG, 
    .mosi_pin =  GPIO_PIN_14, 
    .miso_alternate = GPIO_AF8_SPI6,
    .miso_port = GPIOB, 
    .miso_pin = GPIO_PIN_4, 
    .sck_alternate = GPIO_AF8_SPI6,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_3, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C1,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_9,
    .scl_alternate = GPIO_AF4_I2C1,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_8,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C2,
    .sda_port = GPIOF,
    .sda_pin = GPIO_PIN_0,
    .scl_alternate = GPIO_AF4_I2C2,
    .scl_port = GPIOF,
    .scl_pin = GPIO_PIN_1,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C3,
    .irq = I2C3_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C3,
    .sda_port = GPIOC,
    .sda_pin = GPIO_PIN_9,
    .scl_alternate = GPIO_AF4_I2C3,
    .scl_port = GPIOA,
    .scl_pin = GPIO_PIN_8,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C4,
    .irq = I2C4_EV_IRQn,
    .sda_alternate = GPIO_AF1_I2C4,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_9,
    .scl_alternate = GPIO_AF1_I2C4,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_8,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


